In [1]:
from sql_queries import *
import pandas as pd

In [2]:
from cassandra.cluster import Cluster
cluster = Cluster()
session = cluster.connect()

In [3]:
session.set_keyspace('udacity')

In [4]:
rows = session.execute(query1)
df = pd.DataFrame(list(rows))
df

      artist                             song      length
0  Faithless  Music Matters (Mark Knight Dub)  495.307312

In [5]:
rows = session.execute(query2)
df = pd.DataFrame(list(rows))
df

,artist,song,first_name,last_name
0,Down To The Bone,Keep On Keepin' On,Sylvie,Cruz
1,Three Drives,Greece 2000,Sylvie,Cruz
2,Sebastien Tellier,Kilometer,Sylvie,Cruz
3,Lonnie Gordon,Catch You Baby (Steve Pitron & Max Sanna Radio...,Sylvie,Cruz

In [6]:
rows = session.execute(query3)
df = pd.DataFrame(list(rows))
df

   first_name last_name
0  Jacqueline     Lynch
1       Tegan    Levine
2        Sara   Johnson

In [7]:
session.shutdown()
cluster.shutdown()